import MajorArea from "../models/MajorArea";

const majorAreas = [
  "교양기초(2019학번~)",
  "대학교양(2019학번~)",
  "자율선택(2019학번~)",
  "공통기초(10~18학번)",
  "필수교양(10~18학번)",
  "선택교양(10~18학번)",
  "학부기초(~2009학번)",
  "학부필수(~2009학번)",
  "계열기초(~2009학번)",
  "학부선택(~2009학번)",
  "문과대학",
  "상경대학",
  "경영대학",
  "이과대학",
  "공과대학",
  "생명시스템대학",
  "인공지능융합대학",
  "신과대학",
  "사회과학대학",
  "법과대학",
  "음악대학",
  "교육과학대학",
  "생활과학대학",
  "언더우드국제대학",
  "약학대학",
  "학부대학",
  "간호대학",
  "글로벌인재대학",
  "연계전공",
  "국제캠퍼스(2019학번~)",
  "(~2018학번)국제캠퍼스",
  "ROTC",
  "교직과정",
  "의과대학",
  "치과대학",
  "평생교육사과정",
  "계절학기",
  "Study Abroad Course",
  "국내교환대학",
  "공통",
  "(~2007)국제교육부",
];

export const addMajorAreas = async (campuses) => {
  for (let i = 0; i < majorAreas.length; ++i) {
    await MajorArea.create({
      name: majorAreas[i],
      campus: campuses[0],
    });
  }
};
